<a href="https://colab.research.google.com/github/SainiManisha/dbms-tutorial/blob/master/Convert_CSV_Dataset_to_SQLite_Database.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
!wget https://storage.googleapis.com/manisha1234/students_data_btech_2017.csv

--2020-11-26 19:26:52--  https://storage.googleapis.com/manisha1234/students_data_btech_2017.csv
Resolving storage.googleapis.com (storage.googleapis.com)... 108.177.12.128, 172.217.193.128, 172.217.204.128, ...
Connecting to storage.googleapis.com (storage.googleapis.com)|108.177.12.128|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 1479 (1.4K) [application/octet-stream]
Saving to: ‘students_data_btech_2017.csv’

students_data_btech 100%[===================>]   1.44K  --.-KB/s    in 0s

2020-11-26 19:26:55 (26.8 MB/s) - ‘students_data_btech_2017.csv’ saved [1479/1479]

In [3]:
import sqlite3
import pandas as pd

In [4]:
df = pd.read_csv("students_data_btech_2017.csv")
df.head(10)

   admission_no                name group  ...  mse2  assignment  class_performance
0      17180599       Aditya Sharma    T1  ...    10          12                  6
1      17180814      Akanksha Naidu    T2  ...    20          12                  6
2      17180271         Akash Yadav    T1  ...     2           8                  6
3      17180565         Anand Dagar    T1  ...     6          11                  6
4      17180298       Ankit Rastogi    T1  ...     4           9                  6
5      17180023     Anshudeep Yadav    T1  ...     4          14                  6
6      17180138       Aryan Agarwal    T1  ...    13          16                  6
7      17180264         Aryan Lamba    T1  ...     9           8                  6
8      17180239     Bhupender Yadav    T2  ...     7          12                  6
9      17180418  Dev Kartik agarwal    T2  ...    18           9                  7

[10 rows x 7 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   admission_no       39 non-null     int64
 1   name               39 non-null     object
 2   group              39 non-null     object
 3   mse1               39 non-null     int64
 4   mse2               39 non-null     int64
 5   assignment         39 non-null     int64
 6   class_performance  39 non-null     int64
dtypes: int64(5), object(2)
memory usage: 2.3+ KB

In [6]:
db = sqlite3.connect('students_data.db')

In [7]:
query = """
CREATE TABLE course (
    admission_no INT PRIMARY KEY,
    name VARCHAR(33),
    section VARCHAR(2),
    mse1 INT,
    mse2 INT,
    assignment INT,
    class_performance INT
)
"""
db.execute(query)

In [8]:
query = """
INSERT INTO course VALUES (?, ?, ?, ?, ?, ?, ?)
"""

for row in df.itertuples():
    db.execute(query, tuple(row[1:]))
db.commit()

In [12]:
db.close()